# MultiReferenceAnnotationOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions Class
Members See Also
---
Options which control the creation of MultiReferenceAnnotations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class MultiReferenceAnnotationOptions : IDisposable
```

Visual Basic
---
```text
Public Class MultiReferenceAnnotationOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MultiReferenceAnnotationOptions : IDisposable
```

# Remarks
MultiReferenceAnnotationOptions include the specification of the associated elements and options for the dimension and tag placement.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..MultiReferenceAnnotationOptions
# See Also
MultiReferenceAnnotationOptions Members
Autodesk.Revit.DB Namespace